import streamlit as st
import random


questions = [
    {
        "question": "Формула y = A * e^(-a * x^2) сәйкес келетін қисық аты қандай?",
        "options": [
            "Туынды қатенің қисығы", "Гаусс қатенің қисығы", "Бөлшектік қатенің қисығы",
            "Салыстырмалы қатенің қисығы", "Абсолют қатенің қисығы", "Джоуль қатенің қисығы",
            "Ньютон қатенің қисығы", "Резерфорд қатенің қисығы"
        ],
        "correct": ["Гаусс қатенің қисығы"]
    },
    {
        "question": "Гаусс категориясындағы A тұрақтысын α арқылы өрнекте:",
        "latex": r"\int_{-\infty}^{+\infty} e^{-\alpha x^2} dx = 1",
        "options": [
            "A = √(α / 6π)", "A = √(α / 2π)", "A = √(α / 8π)",
            "A = √(α / 3π)", "A = √(α / 4π)", "A = √(α / π)"
        ],
        "correct": ["A = √(α / π)"]
    },
    {
        "question": "Нақты газдағы α және b түзетулердің өлшем бірлігі қандай?",
        "options": [
            "[a] = Па·м³ / моль, [b] = м³ / моль",
            "[a] = Па·м¹² / моль³, [b] = м⁶ / ммоль",
            "[a] = Па·м¹² / моль³, [b] = м³ / моль³",
            "[a] = Па·м⁶ / моль², [b] = м³ / моль",
            "[a] = Па·м⁶ / моль², [b] = 1 / моль",
            "[a] = Па·м⁶ / моль², [b] = м⁶ / ммоль"
        ],
        "correct": ["[a] = Па·м⁶ / моль², [b] = м³ / моль"]
    },
    {
        "question": "Реперлік нүкте температурасы қандай?",
        "options": [
            "273,16 градус", "473,16 градус", "277,16 градус",
            "273,96 градус", "275,16 градус", "373,16 градус",
            "289,16 градус", "278,16 градус"
        ],
        "correct": ["273,16 градус"]
    },
    {
        "question": "Жылу машинасының ПӘК формуласы қандай?",
        "options": [
            "η = Q₁ / A", "η = Q₂Q₁ / Q₁", "η = (T₁ − T₂) / T₁",
            "η = A / Q₁", "η = (Q₁ − Q₂) / Q₁", "η = (T₁ + T₂) / T₁"
        ],
        "correct": ["η = (T₁ − T₂) / T₁"]
    },
    {
        "question": "Термодинамикалық потенциалдар (Каноникалық күй теңдеулері): қай теңдеу дұрыс?",
        "options": [
            "I = I(W, Q)", "Ψ = Ψ(V, T, S)", "I = I(S, P)",
            "U = U(Q, T)", "U = U(P, S, V)", "Ψ = Ψ(T, S)",
            "U = U(P, S, T, Y)", "U = U(S, V)"
        ],
        "correct": ["Ψ = Ψ(V, T, S)"]
    },
    {
        "question": "Жүйеге dQ жылу берілгенде оның температурасының dT-ға өзгергендегі жылусыйымдылығы C неге тең?",
        "options": [
            "C = δQ / dT × dT", "C = δQ × dT", "C = δQ − dT",
            "C = dT − δQ", "C = δQ + dT", "C = δQ / dT", "C = dT / δQ"
        ],
        "correct": ["C = δQ / dT"]
    },
    {
        "question": "Авогадро санының өрнегі қандай?",
        "options": [
            "Nₐ = R / k", "Nₐ = 2k / R", "Nₐ = k / R",
            "Nₐ = 2R / 5k", "Nₐ = c / k", "Nₐ = 5 / k", "Nₐ = 2R / k"
        ],
        "correct": ["Nₐ = R / k"]
    },
    {
        "question": "Төменнен жоғары ұшып бара жатқан молекулалар беретін қозғалыс саны үшін дұрыс өрнек қандай?",
        "latex": r"G_+ = \frac{1}{3} n \vartheta g_0 + \frac{1}{6} n \vartheta \lambda \frac{dg}{dx}",
        "options": [
            "G₊ = 1/7 nϑg₀ + 1/6 nϑλ dg/dx",
            "G₊ = 1/6 nϑg₀ − 1/6 nϑλ dg/dx",
            "G₊ = 1/3 nϑg₀ + 1/6 nϑλ dg/dx",
            "G₊ = 1/5 nϑg₀ × 1/6 nϑλ dg/dx",
            "G₊ = 1/4 nϑg₀ + 1/6 nϑθλ dg/dx",
            "G₊ = 1/2 nϑg₀ − 1/6 nϑθλ dg/dx"
        ],
        "correct": ["G₊ = 1/3 nϑg₀ + 1/6 nϑλ dg/dx"]
    },
{
    "question": "Ван-дер-Ваальс теңдеуіндегі критикалық шама байланысын көрсететін қатынастар",
    "options": [
        "Vk = 3a/R",
        "Vk = 3/b",
        "pk = b²a / 7",
        "pk = a / 27b²",
        "Tk = a / R",
        "Vk = 3b",
        "Tk = 8a / 27Rb"
    ],
    "correct": ["pk = a / 27b²", "Vk = 3b", "Tk = 8a / 27Rb"]
},
{
    "question": "θ = (2/3) * ε / k тұрақты формуласы арқылы анықталатын θ шамасының атауы",
    "latex": r"\theta = \frac{2}{3} \cdot \frac{\varepsilon}{k}",
    "options": [
        "тұрақты температура", "Авогадро температурасы", "ғарыштық температура",
        "өзгерісті температура", "энергетикалық температура", "Жер температурасы",
        "кинетикалық температура"
    ],
    "correct": ["кинетикалық температура"]
},
{
    "question": "Клапейрон – Менделеев теңдеуімен сипатталмайтын газ",
    "options": [
        "модельденген газ", "өзара әрекет ескерілмейтін газ", "нақты және идеал газ",
        "шынайы газ", "нақты газ", "идеал газ"
    ],
    "correct": ["нақты газ", "шынайы газ"]
},
{
    "question": "Тепе-теңдік күйде бірінен кейін бірі орындалатын идеалданған процестерде кеңінен қолданылатын термодинамикалық теориялық әдістер",
    "options": [
        "квази статистикалық", "кинематикалық әдіс", "динамикалық әдіс",
        "кванттық теле-тепе", "молекулалық", "квази теле-тепе"
    ],
    "correct": ["квази статистикалық"]
},
{
    "question": "Клапейрон-Клаузиус теңдеуі",
    "latex": r"\frac{dP}{dT} = \frac{q_{12}}{T(\vartheta_2 - \vartheta_1)}",
    "options": [
        "dP/dT = q12 / T(θ2 − θ1)",
        "dR/dT = q12 / T(θ2 − θ1)",
        "dT/dT = q12 / T(θ1θ2)",
        "dV/dT = q12 / T(θ2 + θ1)",
        "dP/dT = q12 / T(θ2 + θ1)",
        "dP/dT = q12 / T(θ2 × θ1)"
    ],
    "correct": ["dP/dT = q12 / T(θ2 − θ1)"]
},
{
    "question": "Диффузия коэффициенті мен бөлшектердің қозғалысы арасындағы байланысты көрсететін Эйнштейн формуласы",
    "options": [
        "D = k − TB", "D = k − T − B", "D = kTB",
        "D = kT − B", "D = k + T − B", "D = k + TB", "D = k + T + B"
    ],
    "correct": ["D = kT − B"]
},
{
    "question": "Тартыс өрісі біртекті изотермиялық (T температуралы) жағдайда Жер атмосферасындағы газ молекуласының орташа потенциалдық энергиясын есептеу",
    "options": [
        "⟨εₚ⟩ = 2RkT", "c = cᵥ", "c = c₀", "⟨εₚ⟩ = 3RT",
        "⟨εₚ⟩ = 3RkT", "⟨εₚ⟩ = kT", "c = cₚ"
    ],
    "correct": ["⟨εₚ⟩ = 3RT"]
},
{
    "question": "Атмосфералық құрал",
    "options": [
        "секундомер", "градусник", "Паскаль шары", "Джоуль ыдысы",
        "мұздатқыш", "сағат", "термос", "динамометр"
    ],
    "correct": ["Паскаль шары"]
},
{
    "question": "Сұйық қысымы әртүрлі құбырмен ағады. Қысымның минимал болатын құбырдың қимасы",
    "options": [
        "ағыс жылдамдығы төмен болатын қимада",
        "минималды болмайды, бірдей болады",
        "қимасы ең үлкен жерде",
        "қималарына тәуелді емес",
        "қимасы ең аз жерде"
    ],
    "correct": ["қимасы ең аз жерде"]
},
{
    "question": "Бернулли теңдеуінің тұжырымдамасы",
    "options": [
        "стационар емес ағыс үшін динамикалық қысыммен анықталады",
        "стационар ағысы үшін механикалық энергияның сақталу заңы",
        "стационар ағысы үшін статикалық қысыммен анықталады",
        "стационар ағысы үшін динамикалық қысыммен анықталады",
        "стационар емес ағыс үшін энергияның сақталу заңы"
    ],
    "correct": ["стационар ағысы үшін механикалық энергияның сақталу заңы"]
},
{
    "question": "Ағын дегеніміз",
    "options": [
        "сұйықтың ток сызықтарымен шектелген бөлігі",
        "әрбір нүктесінде жанама болатын сызық",
        "сұйықтың қозғалысы",
        "қозғалисттағы сұйықтың бөлшектерінің жиынтығы",
        "бөлшектердің қозғалысы"
    ],
    "correct": ["сұйықтың ток сызықтарымен шектелген бөлігі"]
},
{
    "question": "Сығымбайтын сұйық үшін үзіліссіздік теңдеуі",
    "options": [
        r"\frac{S_1}{S_2} = \frac{v_2}{v_1}",
        r"S_1v_2 = S_2v_1",
        r"Sv = const",
        r"\rho_1 v_1 = \rho_2 v_2",
        r"\rho v = const"
    ],
    "correct": [r"S_1v_2 = S_2v_1"]
},
{
    "question": "Инерция күштері",
    "options": [
        "санақ жүйесінің үдемелі қозғалысынан туатын күштер",
        "санақ жүйесінің тек ілгерілемелі қозғалысынан туатын инерция күштері",
        "периаралық санақ жүйесіндегі күштер",
        "санақ жүйесінің бұралмалы қозғалысынан туатын күштер",
        "кез келген санақ жүйесіндегі күштер"
    ],
    "correct": ["санақ жүйесінің үдемелі қозғалысынан туатын күштер"]
},
{
    "question": "Күштер әрекет еткен гироскоптық прецессияның бұрыштық жылдамдығы",
    "options": [
        r"\Omega = \frac{M}{L}", r"\Omega = \frac{p}{F}", r"\Omega = \frac{L}{M}",
        r"\Omega = \frac{F}{p}", r"\Omega = \frac{I \omega}{M}"
    ],
    "correct": [r"\Omega = \frac{M}{L}"]
},
{
    "question": "Инерциялық емес санақ жүйесі",
    "options": [
        "инерциялық емес санақ жүйесіне қатысты қозғалатын санақ жүйесі",
        "инерциялық санақ жүйесіне қатыссыз үдеумен қозғалатын санақ жүйесі",
        "инерциялық санақ жүйесіне қатысты үдеумен қозғалатын санақ денесі",
        "инерциялық санақ жүйесіне қатысты жылдамдықпен қозғалатын санақ жүйесі",
        "инерциялық санақ жүйесіне қатысты үдеумен қозғалатын санақ жүйесі"
    ],
    "correct": ["инерциялық санақ жүйесіне қатысты үдеумен қозғалатын санақ жүйесі"]
},
{
    "question": "Тартылыс өрісінің көрінуі",
    "options": [
        "инертілік сипаттама", "күштік сипаттама", "күш сызықтары",
        "энергетикалық сипаттама", "қозғалыс мәндері"
    ],
    "correct": ["күш сызықтары"]
},
{
    "question": "Радиусы R жұқа дөңгелек сақинаның инерция моменті",
    "options": [
        r"I = \frac{1}{12} mR^2", r"I = \frac{1}{2} mR^2", r"I = \frac{1}{3} mR^2",
        r"I = \frac{1}{2} mR", r"I = mR^2"
    ],
    "correct": [r"I = mR^2"]
},
{
    "question": "Әске қатысты материалдық нүктелер жүйесінің инерция моменті",
    "options": [
        r"I = \sum_{i=1}^{n} m_i r_i", r"L = \sum_{i=1}^{n} m_i r_i^2",
        r"I = \sum_{i=1}^{n} m_i r_i^2", r"I = \int r^2 dm", r"I = \sum m_i v_i^2"
    ],
    "correct": [r"I = \sum_{i=1}^{n} m_i r_i^2"]
},
{
    "question": "Күштің t уақыт аралығындағы атқаратын жұмысы",
    "options": [
        r"A = \int_0^t N dt", r"A = -\int_0^t N dt", r"A = \int_0^t N dt",
        r"A = \int_0^t N dt", r"A = \int F dt"
    ],
    "correct": [r"A = \int_0^t N dt"]
},
{
    "question": "Массасы 1000 кг автомобильдің 20 м/с жылдамдығын 30 м/с жылдамдыққа дейін жеткізу үшін жұмыс атқарылады",
    "options": [
        r"2{,}5 \cdot 10^5 Дж", r"2{,}5 \cdot 10^5 Дж", r"5 \cdot 10^3 Дж",
        r"5 \cdot 10^5 Дж", r"5 \cdot 10^3 Дж"
    ],
    "correct": [r"2{,}5 \cdot 10^5 Дж"]
},
{
    "question": "Импульстің сақталу заңы",
    "options": [
        r"L = const", r"\vec{dp} = const", r"\vec{p} = const",
        r"dL = const", r"\vec{L} = const"
    ],
    "correct": [r"\vec{p} = const"]
},
{
    "question": "Жүйенің импульсі",
    "options": [
        "ішкі күштердің әсерінен ғана өзгерте алады",
        "сыртқы күштердің әсерінен ғана өзгерте алады",
        "күштер әсерінсіз өзгерте алады",
        "сыртқы күштердің әсерінен ғана өзгерте алмайды",
        "сыртқы және ішкі күштердің әсерінен ғана өзгерте алады"
    ],
    "correct": ["сыртқы күштердің әсерінен ғана өзгерте алады"]
},
{
    "question": "Импульстің сақталу заңы (формуламен)",
    "options": [
        r"m_1 v_1 + m_2 v_2 = m_1 v_1' + m_2 v_2'",
        r"m_1 \vec{v}_1 + m_2 \vec{v}_2 = m_1 \vec{v}_1' + m_2 \vec{v}_2'",
        r"m_1 v_1 + m_2 v_2 = m_1 v_2' + m_2 v_1'",
        r"m_1 \vec{v}_1 + m_2 \vec{v}_1' = m_2 \vec{v}_2",
        r"m_1 \vec{v}_1' + m_2 \vec{v}_2' = m_1 \vec{v}_2 + m_2 \vec{v}_1"
    ],
    "correct": [r"m_1 \vec{v}_1 + m_2 \vec{v}_2 = m_1 \vec{v}_1' + m_2 \vec{v}_2'"]
},
{
    "question": "Ашық жүйе үшін импульстің сақталу заңы орындалатын шарт",
    "options": [
        "сыртқы күштер белгілі бір бағытта әрекет жасайды",
        "сыртқы күштер қосындысы нөлге тең",
        "ішкі күштер тұрақты",
        "сыртқы күштер мен ішкі күштер тұрақты",
        "сыртқы күштер тұрақты"
    ],
    "correct": ["сыртқы күштер қосындысы нөлге тең"]
},
{
    "question": "Қозғалмай тұрған массасы m дене тұрақты күш әсерінен үдемелі қозғалысқа келіп, S жол жүргенде, жылдамдығы V болған. Бұл күштің қуаты",
    "options": [
        r"N = \frac{mv^3}{2S^2}", r"N = \frac{mv^2}{2S}", r"N = \frac{mv^3}{4S}",
        r"N = \frac{mv}{2S}", r"N = \frac{mv^2}{2S^2}"
    ],
    "correct": [r"N = \frac{mv^3}{2S^2}"]
},
{
    "question": "Күш импульсінің өрнегі",
    "options": [
        r"\vec{p}_2 - \vec{p}_1 = \int_0^t \vec{F} dt",
        r"\vec{p}_2 - \vec{p}_1 = \int_0^t F dt",
        r"\vec{p}_2 - \vec{p}_1 = \int_0^t Ft dt",
        r"\vec{p}_2 = \int_0^t \vec{F} dt",
        r"p_2 - p_1 = \int \vec{F} dt"
    ],
    "correct": [r"\vec{p}_2 - \vec{p}_1 = \int_0^t \vec{F} dt"]
},
{
    "question": "Материалдық нүктелер жүйесінің массалар центрі C нүктесінің радиус-векторы",
    "options": [
        r"\vec{r}_C = \frac{1}{m} \sum_{i=1}^n m_i \vec{r}_i",
        r"\vec{r}_C = \frac{1}{m_i} \sum_{i=1}^n m_i \vec{r}_i",
        r"\vec{r}_C = \frac{1}{m} \sum_{i=1}^n m_i r_i^2",
        r"\vec{r}_C = \frac{1}{m} \sum_{i=1}^n m r_i",
        r"\vec{r}_C = \frac{1}{n} \sum_{i=1}^n m_i \vec{r}_i"
    ],
    "correct": [r"\vec{r}_C = \frac{1}{m} \sum_{i=1}^n m_i \vec{r}_i"]
},
{
    "question": "Электромагниттік әсерге жататын күш",
    "options": [
        "бүкіләлемдік тартылыс күші", "үйкеліс күші", "тұтқырлық күші",
        "гравитациялық күш", "нейтрондардың өзара әсер күші"
    ],
    "correct": ["тұтқырлық күші"]
},
{
    "question": "Айналмалы қозғалыс кезіндегі бұрыштық жылдамдық өрнегі",
    "options": [
        r"\vec{\omega} = \frac{d\varphi}{dt}", r"\omega = \frac{d\varphi}{dt}",
        r"\omega = \frac{d\varphi}{dt}", r"\omega = \frac{d^2 \varphi}{dt}", r"\vec{\omega} = \frac{d\varphi}{dt}"
    ],
    "correct": [r"\omega = \frac{d\varphi}{dt}"]
},
    {
        "question": "Бүкіл әлемдік тартылыс заңы",
        "latex": "F = G \\frac{m_1 m_2}{r^2}",
        "options": [
            "F = G \\frac{m_1 m_2}{r}",
            "F = g \\frac{m_1 m_2}{r^2}",
            "F = \\frac{m_1 m_2}{r^2}",
            "F = G \\frac{m}{r^2}",
            "F = G \\frac{m_1 m_2}{r^2}"
        ],
        "correct": [
            "F = G \\frac{m_1 m_2}{r^2}"
        ]
    },
    {
        "question": "Тартылыс өрісінің потенциалы",
        "latex": "\\varphi = \\frac{GM}{R}",
        "options": [
            "\\varphi = \\frac{F}{m}",
            "\\varphi = \\frac{GM}{R}",
            "\\varphi = \\frac{E_{тол}}{m}",
            "\\varphi = \\frac{\\vec{E}_n}{m}",
            "\\varphi = \\frac{E_n}{m}"
        ],
        "correct": [
            "\\varphi = \\frac{GM}{R}"
        ]
    },
    {
        "question": "Кориолис күші",
        "options": [
            "инерциялық емес санақ жүйесінің ілгерілемелі қозғалысы кезінде пайда болатын инерция күші",
            "айналып тұрған санақ жүйесінде жылдамдықпен қозғалыстағы денеге әсер ететін инерция күші",
            "денелердің өзара әрекеттесулерінен пайда болатын күш",
            "инерцияның центрден тепкіш күші",
            "айналушы санақ жүйесінде тыныштықтағы денеге әсер ететін инерция күші"
        ],
        "correct": [
            "айналып тұрған санақ жүйесінде жылдамдықпен қозғалыстағы денеге әсер ететін инерция күші"
        ]
    },
    {
        "question": "h тереңдіктегі сұйық бағанының қысымы",
        "latex": "p_0 = p + \\rho g h",
        "options": [
            "p = p_0 + \\rho g h",
            "p_0 = p + \\rho g h",
            "p = \\rho g h",
            "p = p_0 - \\rho g h",
            "p = p_0 + \\rho g h"
        ],
        "correct": [
            "p_0 = p + \\rho g h"
        ]
    },
    {
        "question": "Пуазейль формуласы",
        "latex": "Q = \\frac{\\pi R^4 \\Delta p t}{8 \\eta l}",
        "options": [
            "Q = \\frac{\\pi R^4 \\Delta p t}{8 \\eta l}",
            "\\frac{\\pi R^4 pt}{8 \\eta l}",
            "Q = \\frac{\\pi R^2 \\Delta p t}{8 \\eta l}",
            "Q = \\frac{\\pi R^4 \\Delta p t}{8 \\eta}",
            "Q = \\frac{\\pi R^4 (p_2 - p_1) t}{8 \\eta l}"
        ],
        "correct": [
            "Q = \\frac{\\pi R^4 \\Delta p t}{8 \\eta l}"
        ]
    },
    {
        "question": "Торричелли формуласы",
        "latex": "v = \\sqrt{2 g h}",
        "options": [
            "v = 2 g h",
            "\\frac{\\rho}{2} v^2 + p = 0",
            "v = \\sqrt{2 \\rho g h}",
            "v = \\sqrt{2 g h}",
            "S v = const"
        ],
        "correct": [
            "v = \\sqrt{2 g h}"
        ]
    },
    {
        "question": "Тұтқыр ортада баяу қозғалтып келе жатқан шарикке әсер ететін кедергі күшін анықтауға мүмкіндік беретін",
        "options": [
            "Пуазейль формуласы",
            "Бернулли формуласы",
            "Стокс формуласы",
            "Үздіксіздік теңдеуі",
            "Рейнольдс саны"
        ],
        "correct": [
            "Бернулли формуласы"
        ]
    },
    {
        "question": "Гармоникалық тербелістердің дифференциалдық теңдеуі",
        "latex": "\\frac{d^2 s}{dt^2} + \\omega_0^2 s = 0",
        "options": [
            "\\frac{d^2 s}{dt^2} + \\omega_0^3 s = 0",
            "\\frac{ds}{dt} + \\omega_0 s = 0",
            "\\frac{d^2 s}{dt^2} + \\omega_0^2 s = 0",
            "\\frac{d^2 s}{dt^2} + \\omega_0^5 s = 0"
        ],
        "correct": [
            "\\frac{d^2 s}{dt^2} + \\omega_0^2 s = 0"
        ]
    },
  {
    "question": "Тұтқыр ортада баяу қозғалып келе жатқан шарикке әсер ететін кедергі күшін анықтауға мүмкіндік беретін",
    "options": ["Пуазейль формуласы", "Бернулли формуласы", "Стокс формуласы", "Үздіксіздік теңдеуі", "Рейнольдс саны"],
    "answer": "Бернулли формуласы"
  },
  {
    "question": "Тұйық жүйелердің ішкі аймағында қандай процестер жүріп жатса да, импульс моменті",
    "options": ["нөлге тең", "кемиді", "артады", "тұрақты", "тұрақты емес"],
    "answer": "нөлге тең"
  },
  {
    "question": "Инерция заңы",
    "options": ["Гук заңы", "Кулон заңы", "Ньютонның екінші заңы", "Ньютонның бірінші заңы", "Ньютонның үшінші заңы"],
    "answer": "Ньютонның бірінші заңы"
  },
  {
    "question": "Инерция күштерін",
    "options": ["денелердің өзара әрекеттесуі тудырады", "санақ жүйесінің бірқалыпты қозғалысы тудырады", "санақ жүйесінің түзу сызықты қозғалысы тудырады", "санақ жүйесінің үдемелі қозғалысы тудырады", "денелердің үдемелі қозғалысы тудырады"],
    "answer": "денелердің үдемелі қозғалысы тудырады"
  },
  {
    "question": "Оське қатысты күш моменті",
    "options": ["Mz = Iω", "Mz = Iz * dβ/dt", "Mz = Izω", "Mz = I * dβ/dt", "Mz = Iz * β"],
    "answer": "Mz = Izω"
  },
  {
    "question": "Импульс моментінің сақталу заңы",
    "options": ["тұйықталған жүйенің импульсі сақталады", "импульс уақыт бойынша өзгеріссіз қалады", "тұйықталған жүйенің импульс моменті сақталады", "тұйықталмаған жүйенің импульс моменті сақталады", "импульс моменті уақыт бойынша өзгереді"],
    "answer": "импульс уақыт бойынша өзгеріссіз қалады"
  },
  {
    "question": "Нүктенің орын ауыстыруы кезінде атқаратын жұмысы нүктенің бастапқы және ақырғы қалыптарына тәуелсіз болатын күш",
    "options": ["консервативтік", "ауырлық", "диссипативтік", "кулон", "диссипативтік емес"],
    "answer": "консервативтік"
  },
  {
    "question": "Шеңбер бойымен қозғалыс кезінде",
    "options": ["нормал үдеу траекторияға жанама бағытталған", "толық үдеу траекторияға жанама бағытталған", "тангенциал үдеу траекторияға жанама бағытталған", "тангенциал үдеу траекторияға нормаль бағытталған", "тангенциал үдеу шеңбер центріне бағытталған"],
    "answer": "тангенциал үдеу траекторияға жанама бағытталған"
  },
  {
    "question": "Бірқалыпты түзу сызықты қозғалыс",
    "options": ["бірқалыпты үдемелі қозғалыс", "әртүрлі уақыт аралықтарында бірдей жол жүретін қозғалыс", "бірдей уақыт аралықтарында әртүрлі жол жүретін қозғалыс", "бірдей уақыт аралықтарында бірдей жол жүретін қозғалыс", "тұрақты үдеумен өтетін қозғалыс"],
    "answer": "бірдей уақыт аралықтарында бірдей жол жүретін қозғалыс"
  },
  {
    "question": "Материалдық нүктенің нормаль үдеу векторы",
    "options": ["wn = v² / R", "wn = dv / dt", "wt = dv / dt", "wτ = -v² / R", "w = v / R"],
    "answer": "wn = v² / R"
  }
]


st.title("JK-12.07_30.07 - уже тапсырамыз так что оқы оқы және оқы.")

if "selected" not in st.session_state:
    st.session_state.selected = random.sample(questions, 10)

user_answers = {}

with st.form("quiz"):
    for i, q in enumerate(st.session_state.selected, 1):
        st.subheader(f"{i}. {q['question']}")
        if "latex" in q:
            st.latex(q["latex"])

        user_answers[i] = st.multiselect("Выберите ответ(ы):", q["options"], key=f"q{i}")

    submitted = st.form_submit_button("Проверить")

if submitted:
    score = 0
    st.markdown("---")
    st.subheader("📊 Результаты:")

    for i, q in enumerate(st.session_state.selected, 1):
        correct_set = set(q["correct"])
        user_set = set(user_answers[i])

        if user_set == correct_set:
            st.success(f"{i}. ✅ Хорош ")
            score += 1
        else:
            st.error(f"{i}. ❌ Запомни это бл# ")
            st.markdown(f"Правильный ответ: **{', '.join(correct_set)}**")

    st.markdown(f"### ✅ Итог: {score} из {len(st.session_state.selected)}")
